module.exports = {
    Header : {
        HeaderJumborton : true , 
        Brand : ['وبسایت' , 'مهدی پاکروان'],
        programmerImage : 'https://raw.githubusercontent.com/engpakravan/mahdipakravan.ir/master/src/Images/Programmer.png' ,
        list : [
          {
              id : 1 , 
              name : 'خانه' ,
              href : "/home"
          },
          {
              id : 2 , 
              name : 'چطوری کار میکنیم ؟' ,
              href : "/howWorking"
          },
          {
              id : 3 , 
              name : 'توانایی ها' ,
              href : "/skills"
          },
          {
              id : 4 , 
              name : 'نمونه کار ها' ,
              href : "/portfoilo"
          },
          {
              id : 5 , 
              name : 'تماس با ما' ,
              href : "/contactMe"
          }
        ],
        Welcome : `<h2>سلام من <span class="text-red">مهدی</span> هستم !</h2>` ,
        what_can_i_do : `میتونم با <kbd>جاوااسکریپت</kbd> آرزو های شما رو بسازم !` , 
        header_long_text : `لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم استلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است`
    },
    Sections : {
        howWorking : {
            title : 'چطوری با هم پروژه میسازیم ؟' , 
            title_meta : 'یک وبلاگ باحال هم داریم که <kbd>RealTime</kbd> هم هستش !' ,
            elements : [
                {
                    //TODO Get it From Server
                    decoration : "img_right" , 
                    key : '1' , 
                    stepText : 'مرحله اول' , 
                    hyperText : 'در مورد کسب و کارتون صحبت میکنیم !' ,
                    bodyText : 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از <kbd class="bg-red">صنعت چاپ</kbd> و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با <kbd class="bg-red">هدف بهبود</kbd> ابزارهای کاربردی می باشد'
                } ,
                {
                    //TODO Get it From Server
                    decoration : "img_left" , 
                    key : '2' , 
                    stepText : 'مرحله دوم' , 
                    hyperText : 'در مورد کسب و کارتون صحبت میکنیم !' ,
                    bodyText : 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از <kbd class="bg-red">صنعت چاپ</kbd> و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با <kbd class="bg-red">هدف بهبود</kbd> ابزارهای کاربردی می باشد'
                },
                {
                    //TODO Get it From Server
                    decoration : "img_right" , 
                    key : '3' , 
                    stepText : 'مرحله سوم' , 
                    hyperText : 'در مورد کسب و کارتون صحبت میکنیم !' ,
                    bodyText : 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از <kbd class="bg-red">صنعت چاپ</kbd> و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با <kbd class="bg-red">هدف بهبود</kbd> ابزارهای کاربردی می باشد'
                }
            ]
        }
    }
}